google-coral/coralmicro/third_party/modified/nxp/rt1176-sdk/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

void InitArduinoPins(void);

/* FUNCTION
 * ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END
 * ****************************************************************************************************************/
void BOARD_InitBootPins(void) { BOARD_InitPins(); }

/* FUNCTION
 * ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical
 * features.
 *
 * END
 * ****************************************************************************************************************/
void BOARD_InitPins(void) {
    CLOCK_EnableClock(kCLOCK_Iomuxc); /* LPCG on: LPCG is ON. */

    // TPU MCM Pins
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_16_GPIO8_IO26, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_15_GPIO8_IO25, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_14_GPIO8_IO24, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_13_GPIO8_IO23, 0U);

    // LED pins
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06, 0x2U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05, 0x2U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_02_FLEXPWM1_PWM1_A, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_02_FLEXPWM1_PWM1_A, 0U);

    // User button (pulled-up, input)
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_00_DIG_GPIO13_IO03, 1U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SNVS_00_DIG_GPIO13_IO03, 0xCU);

    // Crypto RST
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_08_GPIO12_IO08, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_08_GPIO12_IO08, 0xCU);

    // DMIC
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_00_MIC_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_00_MIC_CLK, 3U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_01_MIC_BITSTREAM0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_01_MIC_BITSTREAM0, 3U);

    // Ethernet
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_00_ENET_1G_RX_EN, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_01_ENET_1G_RX_CLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_02_ENET_1G_RX_DATA00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_03_ENET_1G_RX_DATA01, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_04_ENET_1G_RX_DATA02, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_05_ENET_1G_RX_DATA03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_06_ENET_1G_TX_DATA03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_07_ENET_1G_TX_DATA02, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_08_ENET_1G_TX_DATA01, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_09_ENET_1G_TX_DATA00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_10_ENET_1G_TX_EN, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B1_11_ENET_1G_TX_CLK_IO, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_19_ENET_1G_MDC, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_20_ENET_1G_MDIO, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_02_GPIO8_IO12, 0U);  // RGMII_PHY_INTB
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_03_GPIO8_IO13, 0U);  // ETHPHY_RST_B
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_05_GPIO9_IO04, 0U);      // Buffer

    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_02_GPIO8_IO12,
                        0x4U);  // RGMII_PHY_INTB
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_03_GPIO8_IO13,
                        0x4U);  // ETHPHY_RST_B
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_05_GPIO9_IO04, 2U);

    // I2C5
    /* From freertos_lpi2c sample */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_LPSR_04 is configured as
                                           LPI2C5_SDA */
        1U); /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_LPSR_05 is configured as
                                           LPI2C5_SCL */
        1U); /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_LPSR_04_LPI2C5_SDA, /* GPIO_LPSR_04 PAD functional
                                           properties : */
        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                           Drive Strength Field: normal driver
                                           Pull / Keep Select Field: Pull Disable
                                           Pull Up / Down Config. Field: Weak pull down
                                           Open Drain LPSR Field: Enabled
                                           Domain write protection: Both cores are allowed
                                           Domain write protection lock: Neither of DWP bits is locked
                                         */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_LPSR_05_LPI2C5_SCL, /* GPIO_LPSR_05 PAD functional
                                           properties : */
        0x20U);                         /* Slew Rate Field: Slow Slew Rate
                                           Drive Strength Field: normal driver
                                           Pull / Keep Select Field: Pull Disable
                                           Pull Up / Down Config. Field: Weak pull down
                                           Open Drain LPSR Field: Enabled
                                           Domain write protection: Both cores are allowed
                                           Domain write protection lock: Neither of DWP bits is locked
                                         */

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_24_LPUART1_TXD, /* GPIO_AD_24 is configured
                                                       as LPUART1_TXD */
                     0U); /* Software Input On Field: Input Path is determined
                             by functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_25_LPUART1_RXD, /* GPIO_AD_25 is configured
                                                       as LPUART1_RXD */
                     0U); /* Software Input On Field: Input Path is determined
                             by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_24_LPUART1_TXD, /* GPIO_AD_24 PAD functional properties :
                                        */
        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                          Drive Strength Field: high driver
                                          Pull / Keep Select Field: Pull Disable, Highz
                                          Pull Up / Down Config. Field: Weak pull down
                                          Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_25_LPUART1_RXD, /* GPIO_AD_25 PAD functional properties :
                                        */
        0x02U);                        /* Slew Rate Field: Slow Slew Rate
                                          Drive Strength Field: high driver
                                          Pull / Keep Select Field: Pull Disable, Highz
                                          Pull Up / Down Config. Field: Weak pull down
                                          Open Drain Field: Disabled */

    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_40_LPUART6_TXD, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_41_LPUART6_RXD, 0U);

    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_40_LPUART6_TXD, 0x0EU);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B1_41_LPUART6_RXD, 0x0EU);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_30_LPUART3_TXD, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_31_LPUART3_RXD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_30_LPUART3_TXD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_31_LPUART3_RXD, 0U);

