google-coral/coralmicro/third_party/modified/nxp/rt1176-sdk/pin_mux.c
#if __CORTEX_M == 7
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_00_SEMC_DATA00, /* GPIO_EMC_B1_00 is configured as
                                              SEMC_DATA00 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_01_SEMC_DATA01, /* GPIO_EMC_B1_01 is configured as
                                              SEMC_DATA01 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_02_SEMC_DATA02, /* GPIO_EMC_B1_02 is configured as
                                              SEMC_DATA02 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_03_SEMC_DATA03, /* GPIO_EMC_B1_03 is configured as
                                              SEMC_DATA03 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_04_SEMC_DATA04, /* GPIO_EMC_B1_04 is configured as
                                              SEMC_DATA04 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_05_SEMC_DATA05, /* GPIO_EMC_B1_05 is configured as
                                              SEMC_DATA05 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_06_SEMC_DATA06, /* GPIO_EMC_B1_06 is configured as
                                              SEMC_DATA06 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_07_SEMC_DATA07, /* GPIO_EMC_B1_07 is configured as
                                              SEMC_DATA07 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_08_SEMC_DM00, /* GPIO_EMC_B1_08 is configured as
                                            SEMC_DM00 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_09_SEMC_ADDR00, /* GPIO_EMC_B1_09 is configured as
                                              SEMC_ADDR00 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_10_SEMC_ADDR01, /* GPIO_EMC_B1_10 is configured as
                                              SEMC_ADDR01 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_11_SEMC_ADDR02, /* GPIO_EMC_B1_11 is configured as
                                              SEMC_ADDR02 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_12_SEMC_ADDR03, /* GPIO_EMC_B1_12 is configured as
                                              SEMC_ADDR03 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_13_SEMC_ADDR04, /* GPIO_EMC_B1_13 is configured as
                                              SEMC_ADDR04 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_14_SEMC_ADDR05, /* GPIO_EMC_B1_14 is configured as
                                              SEMC_ADDR05 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_15_SEMC_ADDR06, /* GPIO_EMC_B1_15 is configured as
                                              SEMC_ADDR06 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_16_SEMC_ADDR07, /* GPIO_EMC_B1_16 is configured as
                                              SEMC_ADDR07 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_17_SEMC_ADDR08, /* GPIO_EMC_B1_17 is configured as
                                              SEMC_ADDR08 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_18_SEMC_ADDR09, /* GPIO_EMC_B1_18 is configured as
                                              SEMC_ADDR09 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_19_SEMC_ADDR11, /* GPIO_EMC_B1_19 is configured as
                                              SEMC_ADDR11 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_20_SEMC_ADDR12, /* GPIO_EMC_B1_20 is configured as
                                              SEMC_ADDR12 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_21_SEMC_BA0, /* GPIO_EMC_B1_21 is configured as
                                           SEMC_BA0 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_22_SEMC_BA1, /* GPIO_EMC_B1_22 is configured as
                                           SEMC_BA1 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_23_SEMC_ADDR10, /* GPIO_EMC_B1_23 is configured as
                                              SEMC_ADDR10 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_24_SEMC_CAS, /* GPIO_EMC_B1_24 is configured as
                                           SEMC_CAS */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_25_SEMC_RAS, /* GPIO_EMC_B1_25 is configured as
                                           SEMC_RAS */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_26_SEMC_CLK, /* GPIO_EMC_B1_26 is configured as
                                           SEMC_CLK */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_27_SEMC_CKE, /* GPIO_EMC_B1_27 is configured as
                                           SEMC_CKE */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B1_28_SEMC_WE, /* GPIO_EMC_B1_28 is
                                                       configured as SEMC_WE */
                     0U); /* Software Input On Field: Input Path is determined
                             by functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_29_SEMC_CS0, /* GPIO_EMC_B1_29 is configured as
                                           SEMC_CS0 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_30_SEMC_DATA08, /* GPIO_EMC_B1_30 is configured as
                                              SEMC_DATA08 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_31_SEMC_DATA09, /* GPIO_EMC_B1_31 is configured as
                                              SEMC_DATA09 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_32_SEMC_DATA10, /* GPIO_EMC_B1_32 is configured as
                                              SEMC_DATA10 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_33_SEMC_DATA11, /* GPIO_EMC_B1_33 is configured as
                                              SEMC_DATA11 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_34_SEMC_DATA12, /* GPIO_EMC_B1_34 is configured as
                                              SEMC_DATA12 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_35_SEMC_DATA13, /* GPIO_EMC_B1_35 is configured as
                                              SEMC_DATA13 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_36_SEMC_DATA14, /* GPIO_EMC_B1_36 is configured as
                                              SEMC_DATA14 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_37_SEMC_DATA15, /* GPIO_EMC_B1_37 is configured as
                                              SEMC_DATA15 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_38_SEMC_DM01, /* GPIO_EMC_B1_38 is configured as
                                            SEMC_DM01 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B1_39_SEMC_DQS, /* GPIO_EMC_B1_39 is configured as
                                           SEMC_DQS */
        1U); /* Software Input On Field: Force input path of pad GPIO_EMC_B1_39
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_EMC_B2_18_SEMC_DQS4, /* GPIO_EMC_B2_18 is configured as
                                            SEMC_DQS4 */
        0U); /* Software Input On Field: Input Path is determined by
                functionality */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, /* GPIO_SD_B2_06 is configured as
                                                  FLEXSPI1_A_SS0_B */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_06
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, /* GPIO_SD_B2_07 is configured as
                                                 FLEXSPI1_A_SCLK */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_07
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, /* GPIO_SD_B2_08 is configured
                                                   as FLEXSPI1_A_DATA00 */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_08
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, /* GPIO_SD_B2_09 is configured
                                                   as FLEXSPI1_A_DATA01 */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_09
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, /* GPIO_SD_B2_10 is configured
                                                   as FLEXSPI1_A_DATA02 */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_10
              */
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, /* GPIO_SD_B2_11 is configured
                                                   as FLEXSPI1_A_DATA03 */
        1U); /* Software Input On Field: Force input path of pad GPIO_SD_B2_11
              */
    // IOMUXC_SetPinConfig(
    //     IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS,    /* GPIO_SD_B2_05 PAD
    //     functional properties : */ 0x0AU);                                 /*
    //     PDRV Field: normal driver
    //                                                Pull Down Pull Up Field:
    //                                                PD Open Drain Field:
    //                                                Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, /* GPIO_SD_B2_06 PAD functional
                                                  properties : */
        0x0AU);                                /* PDRV Field: normal driver
                                                  Pull Down Pull Up Field: PD
                                                  Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, /* GPIO_SD_B2_07 PAD functional
                                                 properties : */
        0x0AU);                               /* PDRV Field: normal driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, /* GPIO_SD_B2_08 PAD functional
                                                   properties : */
        0x0AU);                                 /* PDRV Field: normal driver
                                                   Pull Down Pull Up Field: PD
                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, /* GPIO_SD_B2_09 PAD functional
                                                   properties : */
        0x0AU);                                 /* PDRV Field: normal driver
                                                   Pull Down Pull Up Field: PD
                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, /* GPIO_SD_B2_10 PAD functional
                                                   properties : */
        0x0AU);                                 /* PDRV Field: normal driver
                                                   Pull Down Pull Up Field: PD
                                                   Open Drain Field: Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, /* GPIO_SD_B2_11 PAD functional
                                                   properties : */
        0x0AU);                                 /* PDRV Field: normal driver
                                                   Pull Down Pull Up Field: PD
                                                   Open Drain Field: Disabled */

    // CAM_INT
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO9_IO03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_12_GPIO8_IO22, 0U);
    // CAM_TRIG
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_17_GPIO8_IO27, 0U);
    // Camera motion detect
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_05_DIG_GPIO13_IO08, 0U);

