google-coral/coralmicro/third_party/modified/nxp/rt1176-sdk/pin_mux.c
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC, 0U);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_VIDEO_MUX_CSI_DATA09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_VIDEO_MUX_CSI_DATA08, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_VIDEO_MUX_CSI_DATA07, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_VIDEO_MUX_CSI_DATA06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_VIDEO_MUX_CSI_DATA05, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_VIDEO_MUX_CSI_DATA04, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_VIDEO_MUX_CSI_DATA03, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_VIDEO_MUX_CSI_DATA02, 0U);

    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_17_GPIO8_IO27, 0U);

    /* WLAN */
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_USDHC1_CMD, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_USDHC1_CLK, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3, 1U);
    // WL_REG_ON
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_34_GPIO10_IO01, 0U);
    // WL_HOST_WAKE
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_07_GPIO11_IO08, 0U);
    // WL_RST#
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_06_GPIO11_IO07, 0U);
    // WIFI_P_EN
    IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12, 0U);
    // BT_REG_ON
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_35_GPIO10_IO02, 0U);
    // BT_DEV_WAKE
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15, 0U);
    // BT_HOST_WAKE
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_15_GPIO11_IO16, 0U);
    // LPUART2 for BT
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_12_LPUART2_CTS_B, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_DISP_B2_13_LPUART2_RTS_B, 1U);

    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_00_USDHC1_CMD, 0x4U);
    // no-pull
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_01_USDHC1_CLK, 0xCU);
    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_USDHC1_DATA0, 0x4U);
    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_USDHC1_DATA1, 0x4U);
    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_USDHC1_DATA2, 0x4U);
    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_USDHC1_DATA3, 0x4U);
    // WL_REG_ON
    // Module has internal pull-down
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_34_GPIO10_IO01, 0U);
    // WL_HOST_WAKE
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_07_GPIO11_IO08, 0x0U);
    // WL_RST#
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_06_GPIO11_IO07, 0U);
    // WIFI_P_EN
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12, 0x2U);
    // BT_REG_ON
    // Module has internal pull-down
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_35_GPIO10_IO02, 0U);
    // BT_DEV_WAKE
    // Pull-up
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_14_GPIO11_IO15, 0xCU);
    // BT_HOST_WAKE
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_15_GPIO11_IO16, 0xCU);
    // LPUART2 for BT
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_10_LPUART2_TXD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_11_LPUART2_RXD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_12_LPUART2_CTS_B, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_DISP_B2_13_LPUART2_RTS_B, 0U);

#endif

    // GPIO Mode for J9/J10 Header
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_09_GPIO_MUX6_IO09, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_32_GPIO_MUX3_IO31, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_33_GPIO_MUX4_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_06_GPIO_MUX3_IO05, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_07_GPIO_MUX3_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_00_GPIO_MUX2_IO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_01_GPIO_MUX2_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_GPIO_MUX3_IO00, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_GPIO_MUX2_IO31, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07, 0U);

    // Start JTAG pins
    // These pins are set to GPIO for the J10 header.
    // To enable JTAG debugging, comment-out the following 3 lines.
    // If LPSR_13, LPSR_14, and LPSR_15 are muxed elsewhere, they
    // must also be left as default or expliclty set to JTAG_MUX.
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_10_GPIO_MUX6_IO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_11_GPIO_MUX6_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_12_GPIO_MUX6_IO12, 0U);
    // End JTAG pins


#if defined(CORAL_MICRO_ARDUINO) && (CORAL_MICRO_ARDUINO == 1)
    InitArduinoPins();
#endif
}

#if defined(CORAL_MICRO_ARDUINO) && (CORAL_MICRO_ARDUINO == 1)
void InitArduinoPins(void) {
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_07_GPIO_MUX6_IO07, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_06_GPIO_MUX6_IO06, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_00_GPIO_MUX2_IO10, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_01_GPIO_MUX2_IO11, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_FLEXPWM1_PWM0_A, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_FLEXPWM1_PWM0_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 1U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 1U);

    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_32_LPI2C1_SCL, 0x10);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_33_LPI2C1_SDA, 0x10);

    // SPI
    // SPI is on the same pins as JTAG, comment these out if JTAG
    // needs to do arduino-specific debugging
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_09_LPSPI6_PCS0, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_10_LPSPI6_SCK, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_11_LPSPI6_SOUT, 0U);
    IOMUXC_SetPinMux(IOMUXC_GPIO_LPSR_12_LPSPI6_SIN, 0U);

    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_09_LPSPI6_PCS0, 0x0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_10_LPSPI6_SCK, 0x0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_11_LPSPI6_SOUT, 0x0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_LPSR_12_LPSPI6_SIN, 0x0U);
}
#endif

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
